coffee/app/controllers/beans_controller.rb

  def index
    @beans = Bean.all
---
SELECT "beans".* FROM "beans"

    def set_bean
      @bean = Bean.find(params.expect(:id))
---
SELECT "beans".* FROM "beans" WHERE "beans"."id" = 1 LIMIT 1